app/controllers/farms_controller.rb

SELECT * FROM "farms"
---
  def index
    @farms = Farm.all