app/controllers/recipes_controller.rb

SELECT * FROM "recipes"
---
  def index
    @recipes = Recipe.all

SELECT * FROM "recipes" WHERE ("recipes"."id" = 1)
---
  def show
    @recipe = Recipe.find(params[:id])

INSERT INTO "recipes" ("name", "created_at", "updated_at", "description") VALUES('Casbah', '2009-10-01 19:17:39', '2009-10-01 19:17:39', 'Handles rocking the casbah for you.')
---
  def create
    @recipe = Recipe.new(params[:recipe])

    respond_to do |format|
      if @recipe.save